In [2]:
import openpyxl

In [3]:
workbook = openpyxl.load_workbook(r"Employees.xlsx")

In [4]:
workbook.sheetnames

['EmployeeData', 'Skills']

In [5]:
sheet =  workbook["EmployeeData"]
sheet.dimensions

'A1:G21'

In [6]:
for row in sheet.values:
    print(row)

('ID', 'FirstName', 'LastName', 'Department', 'Phone', 'Address', 'Salary')
(1, 'Luke', 'Phillip', 'Sales', 5564567890, '1st Address, Miami', 25000)
(2, 'Jack', 'Darren', 'IT', 3444567891, '2nd Address, Chicago', 33600)
(3, 'Ken', 'Wood', 'IT', 5524567892, '3rd Address, LA', 41150)
(4, 'John', 'Wilson', 'Marketing', 1124567893, '4th Address, Chicago', 50000)
(5, 'Emily', 'Larson', 'Marketing', 1234567894, '5th Address, Miami', 48700)
(6, 'Anna', 'Sullivan', 'Sales', 3324567895, '6th Address, Miami', 29000)
(7, 'Richard', 'Smith', 'Logistics', 6894567896, '7th Address, New York', 66000)
(8, 'Ronnie', 'Moore', 'Sales', 8974567897, '8th Address, New York', 87000)
(9, 'Andrew', 'Drake', 'IT', 6654567898, '9th Address, Las Vegas', 66900)
(10, 'Wayne', 'Barker', 'Logistics', 9884567899, '10th Address, Las Vegas', 89000)
(11, 'Gina', 'Baker', 'Logistics', 1154567900, '11th Address, Chicago', 31800)
(12, 'Andy', 'Williams', 'HR', 1094567901, '12th Address, Chicago', 65500)
(13, 'Jack', 'Wood', 'Logistics', 2044567902, '13th Address, New York', 90300)
(14, 'Jane', 'Phills', 'HR', 1664567903, '14th Address, New York', 77700)
(15, 'Ron', 'Johnson', 'Sales', 1664567904, '15th Address, New York', 26250)
(16, 'Jackie', 'Stanley', 'Sales', 6894567905, '16th Address, Las Vegas', 38400)
(17, 'Charles', 'Meyer', 'Marketing', 1154567906, '17th Address, Las Vegas', 47000)
(18, 'Charlie', 'Smith', 'Marketing', 9884567907, '18th Address, Las Vegas', 49000)
(19, 'Wayne', 'Andrews', 'Sales', 3324567908, '19th Address, LA', 52000)
(20, 'Adrian', 'Harrison', 'IT', 1234567909, '20th Address, LA', 21160)

In [7]:
data = []
for row in sheet.values:
    a,b,c,d,e,f,g = row
    data.append("{};{};{};{};{};{};{}".format(a,b,c,d,e,f,g))

data

['ID;FirstName;LastName;Department;Phone;Address;Salary',
 '1;Luke;Phillip;Sales;5564567890;1st Address, Miami;25000',
 '2;Jack;Darren;IT;3444567891;2nd Address, Chicago;33600',
 '3;Ken;Wood;IT;5524567892;3rd Address, LA;41150',
 '4;John;Wilson;Marketing;1124567893;4th Address, Chicago;50000',
 '5;Emily;Larson;Marketing;1234567894;5th Address, Miami;48700',
 '6;Anna;Sullivan;Sales;3324567895;6th Address, Miami;29000',
 '7;Richard;Smith;Logistics;6894567896;7th Address, New York;66000',
 '8;Ronnie;Moore;Sales;8974567897;8th Address, New York;87000',
 '9;Andrew;Drake;IT;6654567898;9th Address, Las Vegas;66900',
 '10;Wayne;Barker;Logistics;9884567899;10th Address, Las Vegas;89000',
 '11;Gina;Baker;Logistics;1154567900;11th Address, Chicago;31800',
 '12;Andy;Williams;HR;1094567901;12th Address, Chicago;65500',
 '13;Jack;Wood;Logistics;2044567902;13th Address, New York;90300',
 '14;Jane;Phills;HR;1664567903;14th Address, New York;77700',
 '15;Ron;Johnson;Sales;1664567904;15th Address, New York;26250',
 '16;Jackie;Stanley;Sales;6894567905;16th Address, Las Vegas;38400',
 '17;Charles;Meyer;Marketing;1154567906;17th Address, Las Vegas;47000',
 '18;Charlie;Smith;Marketing;9884567907;18th Address, Las Vegas;49000',
 '19;Wayne;Andrews;Sales;3324567908;19th Address, LA;52000',
 '20;Adrian;Harrison;IT;1234567909;20th Address, LA;21160']

In [8]:
employees = "\n".join(data)
employees

'ID;FirstName;LastName;Department;Phone;Address;Salary\n1;Luke;Phillip;Sales;5564567890;1st Address, Miami;25000\n2;Jack;Darren;IT;3444567891;2nd Address, Chicago;33600\n3;Ken;Wood;IT;5524567892;3rd Address, LA;41150\n4;John;Wilson;Marketing;1124567893;4th Address, Chicago;50000\n5;Emily;Larson;Marketing;1234567894;5th Address, Miami;48700\n6;Anna;Sullivan;Sales;3324567895;6th Address, Miami;29000\n7;Richard;Smith;Logistics;6894567896;7th Address, New York;66000\n8;Ronnie;Moore;Sales;8974567897;8th Address, New York;87000\n9;Andrew;Drake;IT;6654567898;9th Address, Las Vegas;66900\n10;Wayne;Barker;Logistics;9884567899;10th Address, Las Vegas;89000\n11;Gina;Baker;Logistics;1154567900;11th Address, Chicago;31800\n12;Andy;Williams;HR;1094567901;12th Address, Chicago;65500\n13;Jack;Wood;Logistics;2044567902;13th Address, New York;90300\n14;Jane;Phills;HR;1664567903;14th Address, New York;77700\n15;Ron;Johnson;Sales;1664567904;15th Address, New York;26250\n16;Jackie;Stanley;Sales;6894567905;16th Address, Las Vegas;38400\n17;Charles;Meyer;Marketing;1154567906;17th Address, Las Vegas;47000\n18;Charlie;Smith;Marketing;9884567907;18th Address, Las Vegas;49000\n19;Wayne;Andrews;Sales;3324567908;19th Address, LA;52000\n20;Adrian;Harrison;IT;1234567909;20th Address, LA;21160'

<b>Question 1:</b> Get the last name of the employees whose salary is less than 30000 but at least 24000

In [9]:
import re
s1 = re.findall(r"\d{1,};.+?;(.+?);.+?;2[4-9]\d{3}", employees)
s1

['Phillip', 'Sullivan', 'Johnson']

<b>Question 2:</b> Get the last names of the employees whose department is either IT or Marketing and their last name is no longer than 5 character.

In [10]:
s2 = re.findall(r"\d{1,};.+?;(.{1,5});(IT|Marketing);.+?;\d{5}", employees)
s2

[('Wood', 'IT'),
 ('Drake', 'IT'),
 ('Meyer', 'Marketing'),
 ('Smith', 'Marketing')]

In [11]:
[i[0] for i in s2]

['Wood', 'Drake', 'Meyer', 'Smith']

In [12]:
# 2nd approach
s2 = re.findall(r"\d{1,};.+?;(.{1,5});(?:IT|Marketing);.+?;\d{5}", employees)
s2

['Wood', 'Drake', 'Meyer', 'Smith']

<b>Question 3:</b> Get the name of all the employees whose name start with `P` or any other letter following the alphabet `P` and the employees should have their phone number starting with <b>even digit and end with an odd digit</b>.

In [24]:
s3 = re.findall(r"\d{1,};([P-Z].+?);.+;[2468]\d{8}[13579]", employees)
s3

['Ronnie']

<b>Question 4:</b> Get the first name, last name & phone number of all the employees who are located in New York and are working in the Sales department

In [26]:
s4 = re.findall(r"\d{1,};(.+?);(.+?);Sales;(.+?);.+New York",employees)
s4

[('Ronnie', 'Moore', '8974567897'), ('Ron', 'Johnson', '1664567904')]

In [28]:
result = [" ".join(i) for i in s4]
result

['Ronnie Moore 8974567897', 'Ron Johnson 1664567904']

<b>Question 5:</b> Get the last name of all the employees whose doesn't live in Miami.

In [33]:
s5 = re.findall(r"\d{1,};.+?;(.+?);.+?;.+?;.+, (?!Miami)", employees)
s5

['Darren',
 'Wood',
 'Wilson',
 'Smith',
 'Moore',
 'Drake',
 'Barker',
 'Baker',
 'Williams',
 'Wood',
 'Phills',
 'Johnson',
 'Stanley',
 'Meyer',
 'Smith',
 'Andrews',
 'Harrison']